In [10]:
import time
a = range(10000000)
b = range(10000000)

In [12]:
t1 = time.time()
c = []
for i,j in zip(a,b):
    c.append(i+j)
t2 = time.time()
t2-t1

4.062227249145508

In [13]:
#Using numpy to run same thing and find out the time

In [14]:
import numpy as np
a = np.arange(10000000)
b = np.arange(10000000)

In [15]:
t1 = time.time()
c = []
for i,j in zip(a,b):
    c.append(i+j)
t2 = time.time()
t2-t1

4.4839677810668945

In [16]:
t1 = time.time()
c = a+b
t2 = time.time()
t2-t1

0.29683756828308105

### great performace increase when we use np array over normal arrays
Numpys codes are in C and fortran, thats why its fast!!

### 1)Vectorization:
                  (Multiple values with a direction) a- 10 is a scalar,b = [1,2,3] is a    scalar.Wriring all opearation without using loop is called vectorisation
    
    2)Broadcasting:
                can do operation on different dimension and salar and vector

In [26]:
a = np.arange(3)
b = np.array([1,2])
c = a + 101
c
d = a+ b
d

ValueError: operands could not be broadcast together with shapes (3,) (2,)

# Pandas - 
group by
one column is called as series

Pandas got indexing for columns also
dataframe is like a excel sheet

Series is one columns

we can rename indexes also if we want

In [29]:
import pandas as pd
S = pd.Series([1,2,3,4])

In [33]:
type(S)

pandas.core.series.Series

In [34]:
S

0    1
1    2
2    3
3    4
dtype: int64

In [64]:
#Creating dataframe
S = pd.DataFrame?

In [ ]:
S = pd.DataFrame

In [ ]:
S = pd.DataFrame

In [50]:
S = pd.DataFrame(data=[['Ashwin',29],['rock',2]],columns =['NAME','AGE'])

In [51]:
S

     NAME  AGE
0  Ashwin   29
1    rock    2

In [65]:
#Using dictionary
empdata = {"name":["Ash","ABi","ANuj",],"age":[23,25,30],"Salary":[20000,30000,40000]}

In [71]:
p = pd.DataFrame(empdata, columns=["name","Salary"])

In [72]:
p

   name  Salary
0   Ash   20000
1   ABi   30000
2  ANuj   40000

In [73]:
employee_dict = [{"name":"Alwin","age":28, "dept":"engineering","designation":"DB Engineer","salary":30000},
                 {"name":"Basheer","age":33, "dept":"engineering","designation":"Architect","salary":80000},
                 {"name":"Caleb","age":30, "dept":"sales","designation":"Sales Officer","salary":60000},
                 {"name":"Candy","age":50, "dept":"sales","designation":"VP","salary":100000},
                 {"name":"Dinesh","age":50, "dept":"support","designation":"VP","salary":200000},
                 {"name":"Ezhil","age":20, "dept":"hr","designation":"Intern","salary":5000}]

In [74]:
S = pd.DataFrame(employee_dict)

In [75]:
S

   age         dept    designation     name  salary
0   28  engineering    DB Engineer    Alwin   30000
1   33  engineering      Architect  Basheer   80000
2   30        sales  Sales Officer    Caleb   60000
3   50        sales             VP    Candy  100000
4   50      support             VP   Dinesh  200000
5   20           hr         Intern    Ezhil    5000

In [78]:
S['designation'].count()

6

In [81]:
a= S['designation']

In [89]:
B = S.iloc[:,::-3]
B

   salary         dept
0   30000  engineering
1   80000  engineering
2   60000        sales
3  100000        sales
4  200000      support
5    5000           hr

In [91]:
columns = ['name','salary']
A =S[columns]
A

      name  salary
0    Alwin   30000
1  Basheer   80000
2    Caleb   60000
3    Candy  100000
4   Dinesh  200000
5    Ezhil    5000

In [93]:
A.shape

(6, 2)

In [102]:
#iloc - numerical default indexes[row(row start:row end),column(column start:column end)]
S.iloc[2:5,0:-2]

   age     dept    designation
2   30    sales  Sales Officer
3   50    sales             VP
4   50  support             VP

In [116]:
S.iloc[:,:-2] #:means all columns to right/left

   age         dept    designation
0   28  engineering    DB Engineer
1   33  engineering      Architect
2   30        sales  Sales Officer
3   50        sales             VP
4   50      support             VP
5   20           hr         Intern

In [117]:
S.iloc[:,[1,3]] #alternate columns

          dept     name
0  engineering    Alwin
1  engineering  Basheer
2        sales    Caleb
3        sales    Candy
4      support   Dinesh
5           hr    Ezhil

In [118]:
#LOC
S.loc[0:3,['name','dept']]

      name         dept
0    Alwin  engineering
1  Basheer  engineering
2    Caleb        sales
3    Candy        sales

In [122]:
#LOC
S.loc[0:3,'age':'name']

   age         dept    designation     name
0   28  engineering    DB Engineer    Alwin
1   33  engineering      Architect  Basheer
2   30        sales  Sales Officer    Caleb
3   50        sales             VP    Candy

In [132]:
S.loc[S['salary']>80000,['name','salary']]

     name  salary
3   Candy  100000
4  Dinesh  200000

In [127]:
S.loc?